; domain
(define (domain logistics-strips)
  (:requirements :strips :constraints)
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
		(AIRPLANE ?airplane)
                (CITY ?city)
                (AIRPORT ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city))
 
  ; (:types )		; default object

(:action LOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (AIRPLANE ?airplane) (AIRPORT ?loc-from) (AIRPORT ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-c6-s3-p8-a2)
(:domain logistics-strips)
(:objects a0 a1 
          c0 c1 c2 c3 c4 c5 
          t0 t1 t2 t3 t4 t5 
          l0-0 l0-1 l0-2 l1-0 l1-1 l1-2 l2-0 l2-1 l2-2 l3-0 l3-1 l3-2 l4-0 l4-1 l4-2 l5-0 l5-1 l5-2 
          p0 p1 p2 p3 p4 p5 p6 p7 
)
(:init
    (AIRPLANE a0)
    (AIRPLANE a1)
    (CITY c0)
    (CITY c1)
    (CITY c2)
    (CITY c3)
    (CITY c4)
    (CITY c5)
    (TRUCK t0)
    (TRUCK t1)
    (TRUCK t2)
    (TRUCK t3)
    (TRUCK t4)
    (TRUCK t5)
    (LOCATION l0-0)
    (in-city  l0-0 c0)
    (LOCATION l0-1)
    (in-city  l0-1 c0)
    (LOCATION l0-2)
    (in-city  l0-2 c0)
    (LOCATION l1-0)
    (in-city  l1-0 c1)
    (LOCATION l1-1)
    (in-city  l1-1 c1)
    (LOCATION l1-2)
    (in-city  l1-2 c1)
    (LOCATION l2-0)
    (in-city  l2-0 c2)
    (LOCATION l2-1)
    (in-city  l2-1 c2)
    (LOCATION l2-2)
    (in-city  l2-2 c2)
    (LOCATION l3-0)
    (in-city  l3-0 c3)
    (LOCATION l3-1)
    (in-city  l3-1 c3)
    (LOCATION l3-2)
    (in-city  l3-2 c3)
    (LOCATION l4-0)
    (in-city  l4-0 c4)
    (LOCATION l4-1)
    (in-city  l4-1 c4)
    (LOCATION l4-2)
    (in-city  l4-2 c4)
    (LOCATION l5-0)
    (in-city  l5-0 c5)
    (LOCATION l5-1)
    (in-city  l5-1 c5)
    (LOCATION l5-2)
    (in-city  l5-2 c5)
    (AIRPORT l0-0)
    (AIRPORT l1-0)
    (AIRPORT l2-0)
    (AIRPORT l3-0)
    (AIRPORT l4-0)
    (AIRPORT l5-0)
    (OBJ p0)
    (OBJ p1)
    (OBJ p2)
    (OBJ p3)
    (OBJ p4)
    (OBJ p5)
    (OBJ p6)
    (OBJ p7)
    (at t0 l0-0)
    (at t1 l1-0)
    (at t2 l2-0)
    (at t3 l3-1)
    (at t4 l4-1)
    (at t5 l5-2)
    (at p0 l4-0)
    (at p1 l5-2)
    (at p2 l5-0)
    (at p3 l5-2)
    (at p4 l5-0)
    (at p5 l0-0)
    (at p6 l3-2)
    (at p7 l0-2)
    (at a0 l1-0)
    (at a1 l3-0)
)
(:goal
    (and
        (at p0 l3-0)
        (at p1 l4-2)
        (at p2 l5-1)
        (at p3 l5-1)
        (at p4 l4-2)
        (at p5 l4-1)
        (at p6 l4-0)
        (at p7 l4-0)
    )
)

  (:constraints
    (and
      (always (not (in p2 a0)))
      (always (not (in p2 a1)))
      (always (not (in p3 a0)))
      (always (not (in p3 a1)))
    )
  )
)

; plan
1. (drive-truck t3 l3-1 l3-2 c3)
   deleted: (at t3 l3-1)
   added: (at t3 l3-2)
   goals met: 0 of 8
2. (load-truck p3 t5 l5-2)
   deleted: (at p3 l5-2)
   added: (in p3 t5)
   goals met: 0 of 8
3. (load-truck p1 t5 l5-2)
   deleted: (at p1 l5-2)
   added: (in p1 t5)
   goals met: 0 of 8
4. (fly-airplane a0 l1-0 l5-0)
   deleted: (at a0 l1-0)
   added: (at a0 l5-0)
   goals met: 0 of 8
5. (fly-airplane a1 l3-0 l5-0)
   deleted: (at a1 l3-0)
   added: (at a1 l5-0)
   goals met: 0 of 8
6. (drive-truck t0 l0-0 l0-2 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-2)
   goals met: 0 of 8
7. (drive-truck t4 l4-1 l4-0 c4)
   deleted: (at t4 l4-1)
   added: (at t4 l4-0)
   goals met: 0 of 8
8. (drive-truck t5 l5-2 l5-1 c5)
   deleted: (at t5 l5-2)
   added: (at t5 l5-1)
   goals met: 0 of 8
9. (load-truck p6 t3 l3-2)
   deleted: (at p6 l3-2)
   added: (in p6 t3)
   goals met: 0 of 8
10. (load-airplane p4 a0 l5-0)
   deleted: (at p4 l5-0)
   added: (in p4 a0)
   goals met: 0 of 8
11. (load-truck p7 t0 l0-2)
   deleted: (at p7 l0-2)
   added: (in p7 t0)
   goals met: 0 of 8
12. (fly-airplane a1 l5-0 l4-0)
   deleted: (at a1 l5-0)
   added: (at a1 l4-0)
   goals met: 0 of 8
13. (drive-truck t3 l3-2 l3-0 c3)
   deleted: (at t3 l3-2)
   added: (at t3 l3-0)
   goals met: 0 of 8
14. (unload-truck p3 t5 l5-1)
   deleted: (in p3 t5)
   added: (at p3 l5-1)
   goals met: 1 of 8
15. (drive-truck t0 l0-2 l0-0 c0)
   deleted: (at t0 l0-2)
   added: (at t0 l0-0)
   goals met: 1 of 8
16. (load-airplane p0 a1 l4-0)
   deleted: (at p0 l4-0)
   added: (in p0 a1)
   goals met: 1 of 8
17. (unload-truck p6 t3 l3-0)
   deleted: (in p6 t3)
   added: (at p6 l3-0)
   goals met: 1 of 8
18. (unload-truck p7 t0 l0-0)
   deleted: (in p7 t0)
   added: (at p7 l0-0)
   goals met: 1 of 8
19. (drive-truck t5 l5-1 l5-0 c5)
   deleted: (at t5 l5-1)
   added: (at t5 l5-0)
   goals met: 1 of 8
20. (fly-airplane a1 l4-0 l0-0)
   deleted: (at a1 l4-0)
   added: (at a1 l0-0)
   goals met: 1 of 8
21. (unload-truck p1 t5 l5-0)
   deleted: (in p1 t5)
   added: (at p1 l5-0)
   goals met: 1 of 8
22. (load-truck p2 t5 l5-0)
   deleted: (at p2 l5-0)
   added: (in p2 t5)
   goals met: 1 of 8
23. (load-airplane p7 a1 l0-0)
   deleted: (at p7 l0-0)
   added: (in p7 a1)
   goals met: 1 of 8
24. (load-airplane p5 a1 l0-0)
   deleted: (at p5 l0-0)
   added: (in p5 a1)
   goals met: 1 of 8
25. (drive-truck t5 l5-0 l5-1 c5)
   deleted: (at t5 l5-0)
   added: (at t5 l5-1)
   goals met: 1 of 8
26. (load-airplane p1 a0 l5-0)
   deleted: (at p1 l5-0)
   added: (in p1 a0)
   goals met: 1 of 8
27. (fly-airplane a1 l0-0 l4-0)
   deleted: (at a1 l0-0)
   added: (at a1 l4-0)
   goals met: 1 of 8
28. (unload-truck p2 t5 l5-1)
   deleted: (in p2 t5)
   added: (at p2 l5-1)
   goals met: 2 of 8
29. (fly-airplane a0 l5-0 l4-0)
   deleted: (at a0 l5-0)
   added: (at a0 l4-0)
   goals met: 2 of 8
30. (unload-airplane p7 a1 l4-0)
   deleted: (in p7 a1)
   added: (at p7 l4-0)
   goals met: 3 of 8
31. (unload-airplane p5 a1 l4-0)
   deleted: (in p5 a1)
   added: (at p5 l4-0)
   goals met: 3 of 8
32. (unload-airplane p4 a0 l4-0)
   deleted: (in p4 a0)
   added: (at p4 l4-0)
   goals met: 3 of 8
33. (unload-airplane p1 a0 l4-0)
   deleted: (in p1 a0)
   added: (at p1 l4-0)
   goals met: 3 of 8
34. (fly-airplane a1 l4-0 l3-0)
   deleted: (at a1 l4-0)
   added: (at a1 l3-0)
   goals met: 3 of 8
35. (load-truck p4 t4 l4-0)
   deleted: (at p4 l4-0)
   added: (in p4 t4)
   goals met: 3 of 8
36. (load-truck p1 t4 l4-0)
   deleted: (at p1 l4-0)
   added: (in p1 t4)
   goals met: 3 of 8
37. (load-truck p5 t4 l4-0)
   deleted: (at p5 l4-0)
   added: (in p5 t4)
   goals met: 3 of 8
38. (unload-airplane p0 a1 l3-0)
   deleted: (in p0 a1)
   added: (at p0 l3-0)
   goals met: 4 of 8
39. (load-airplane p6 a1 l3-0)
   deleted: (at p6 l3-0)
   added: (in p6 a1)
   goals met: 4 of 8
40. (drive-truck t4 l4-0 l4-2 c4)
   deleted: (at t4 l4-0)
   added: (at t4 l4-2)
   goals met: 4 of 8
41. (fly-airplane a1 l3-0 l4-0)
   deleted: (at a1 l3-0)
   added: (at a1 l4-0)
   goals met: 4 of 8
42. (unload-truck p1 t4 l4-2)
   deleted: (in p1 t4)
   added: (at p1 l4-2)
   goals met: 5 of 8
43. (unload-truck p4 t4 l4-2)
   deleted: (in p4 t4)
   added: (at p4 l4-2)
   goals met: 6 of 8
44. (unload-airplane p6 a1 l4-0)
   deleted: (in p6 a1)
   added: (at p6 l4-0)
   goals met: 7 of 8
45. (drive-truck t4 l4-2 l4-1 c4)
   deleted: (at t4 l4-2)
   added: (at t4 l4-1)
   goals met: 7 of 8
46. (unload-truck p5 t4 l4-1)
   deleted: (in p5 t4)
   added: (at p5 l4-1)
   goals met: 8 of 8
